Repository: WMSols/elegant_advisors
Catalog: lib/core/l10n/app_*.arb
Languages: pt

# webName
source: Elegant
pt: Elegant Advisors

# logoSubtitle
source: REAL ESTATE
pt: IMOBILIÁRIA

# navHome
source: Home
pt: Início

# navProperties
source: Properties
pt: Propriedades

# navOffMarket
source: Off Market
pt: Fora do Mercado

# navContact
source: Contact
pt: Contato

# homeTitle
source: REAL ESTATE ADVISORY & INVESTMENT BROKERAGE
pt: ELEGÂNCIA, INTEGRIDADE, TRANSPARÊNCIA

# homeSubtitle
source: Elegant is a real estate advisory and investment brokerage defined by a singular philosophy: real estate, at its finest, is an art of elegance. We curate exceptional property opportunities in Portugal and the Iberian region, guided by discretion, market insight, and uncompromising standards.
pt: A Elegant é uma consultoria imobiliária definida por uma filosofia singular: o imobiliário, no seu melhor, é uma arte de elegância. Cuidamos de oportunidades excepcionais de propriedade em Portugal, guiados por discrição, conhecimento de mercado e padrões intransigentes.

# homeButtonConsultation
source: Request A Private Consultation
pt: Solicitar Consultoria Privada

# homeOurApproachTitle
source: OUR APPROACH
pt: NOSSA ABORDAGEM

# homeOurApproachDescription
source: By combining deep local market knowledge with strong international networks, we deliver considered, investment-led real estate advisory across the full transaction lifecycle — from strategy and asset sourcing to acquisition, due diligence, structuring, and execution. We act as a trusted local advisory and execution partner for private clients, developers, and professional investors seeking structured exposure to Iberian real estate, with a clear focus on quality, alignment, and long-term value creation.
pt: Combinamos inteligência de mercado profunda com redes locais e internacionais fortes para fornecer serviços de consultoria personalizados em todo o ciclo de vida do investimento — desde a definição de estratégia e origem de ativos até aquisição, due diligence, estruturação e fechamento. Cada cliente recebe orientação discreta e baseada em dados alinhada com seus objetivos financeiros, perfil de risco e horizonte de investimento.

# homeOurApproachButton
source: What We Do
pt: O Que Fazemos

# homeOurPhilosophyMissionTitle
source: OUR PHILOSOPHY & MISSION
pt: NOSSA FILOSOFIA E MISSÃO

# homeOurPhilosophyMissionDescription
source: Elegance, discretion, and integrity define how we operate. We take a considered, investment-led approach to real estate advisory, focusing on quality, alignment, and long-term value creation in every engagement.
pt: Elegância, integridade e transparência definem como operamos. Na Elegant, acreditamos em qualidade sobre volume — cuidando cuidadosamente de oportunidades residenciais, comerciais e de hospitalidade que se alinham precisamente com as ambições de estilo de vida ou estratégia de investimento de cada cliente.

# homeOurPhilosophyTitle
source: OUR PHILOSOPHY
pt: NOSSA FILOSOFIA

# homeOurPhilosophyDescription
source: Elegance, discretion, and integrity define how we operate. We take a considered, investment-led approach to real estate advisory, focusing on quality, alignment, and long-term value creation in every engagement.
pt: Elegância, integridade e transparência definem como operamos. Na Elegant, acreditamos em qualidade sobre volume — cuidando cuidadosamente de oportunidades residenciais, comerciais e de hospitalidade que se alinham precisamente com as ambições de estilo de vida ou estratégia de investimento de cada cliente.

# homeOurMissionTitle
source: OUR MISSION
pt: NOSSA MISSÃO

# homeOurMissionDescription
source: Our mission is to deliver clarity and sophistication at every stage of the property journey, ensuring each acquisition is as seamless as it is distinguished.
pt: Nossa missão é entregar clareza e sofisticação em cada etapa da jornada imobiliária, garantindo que cada aquisição seja tão perfeita quanto distinta.

# homeWhatWeSpecializeInTitle
source: WHAT WE SPECIALISE IN
pt: NO QUE NOS ESPECIALIZAMOS

# homeWhatWeSpecializeInDescription
source: We specialise in curating exceptional property opportunities across multiple asset classes, each tailored to meet distinct investment objectives and lifestyle aspirations.
pt: Especializamo-nos em cuidar de oportunidades excepcionais de propriedade em várias classes de ativos, cada uma adaptada para atender a objetivos de investimento distintos e aspirações de estilo de vida.

# homeWhatWeSpecializeInHighEndResidentialTitle
source: PRIVATE RESIDENTIAL ADVISORY
pt: ATIVOS RESIDENCIAIS DE ALTO PADRÃO

# homeWhatWeSpecializeInHighEndResidentialDescription
source: High-end residential assets: luxury villas, premium apartments, and exclusive residential properties in prime locations. Tailored for private clients seeking a primary residence, secondary home, or long-term lifestyle asset, with a focus on quality, discretion, and long-term value.
pt: Villas de luxo, apartamentos premium e propriedades residenciais exclusivas em locais privilegiados — curadas para compradores de estilo de vida e investidores que buscam valorização de capital a longo prazo.

# homeWhatWeSpecializeInInvestmentPlotsTitle
source: DEVELOPMENT LAND & STRATEGIC PLOTS
pt: LOTES DE INVESTIMENTO E TERRENOS PARA DESENVOLVIMENTO

# homeWhatWeSpecializeInInvestmentPlotsDescription
source: Strategic land opportunities for residential, commercial, and hospitality developments. Suitable for developers and institutional capital seeking scalable projects with planning visibility and clearly defined exit strategies.
pt: Oportunidades estratégicas de terrenos para desenvolvimentos residenciais, comerciais e de hospitalidade. Adequado para desenvolvedores, gestores de ativos, fundos de private equity e investidores de longo prazo que buscam crescimento escalável.

# homeWhatWeSpecializeInInvestmentBuildingsTitle
source: INVESTMENT BUILDINGS
pt: EDIFÍCIOS DE INVESTIMENTO

# homeWhatWeSpecializeInInvestmentBuildingsDescription
source: Building acquisitions suitable for refurbishment, repositioning, or redevelopment, including assets structured for income generation, phased disposals, or full exit strategies. Opportunities are relevant for developers, funds, and asset managers seeking value creation through active asset management, redevelopment, or strategic sale.
pt: Edifícios inteiros que requerem renovação, reforma ou reurbanização para uso residencial ou comercial. Ideal para desenvolvedores, gestores de ativos, fundos de private equity e investidores que buscam estratégias de valor agregado e reposicionamento.

# homeWhatWeSpecializeInCommercialRealEstateTitle
source: COMMERCIAL REAL ESTATE
pt: IMÓVEIS COMERCIAIS

# homeWhatWeSpecializeInCommercialRealEstateDescription
source: Retail, office, and mixed-use assets, including income-generating properties with stable or growing cash flows. Opportunities assessed on a risk-adjusted, underwriting-led basis consistent with professional investment mandates.
pt: Ativos de varejo, escritórios, estacionamentos e industriais — incluindo propriedades geradoras de renda com inquilinos estáveis e perfis de rendimento fortes.

# homeWhatWeSpecializeInHospitalityTitle
source: HOSPITALITY & HOTEL INVESTMENTS
pt: INVESTIMENTOS EM HOSPITALIDADE E HOTÉIS

# homeWhatWeSpecializeInHospitalityDescription
source: Advisory across hotels, serviced apartments, boutique hotels, resorts, and mixed-use hospitality developments. We support acquisitions, repositioning strategies, operational assets, and development-led hospitality projects, targeting sustainable yield and long-term value creation.
pt: Um foco dedicado em hotéis, apartamentos com serviços, hotéis boutique, resorts e desenvolvimentos de hospitalidade de uso misto. Aconselhamos sobre aquisições, oportunidades de reposicionamento, ativos operacionais e projetos liderados por desenvolvimento — visando tanto rendimento quanto criação de valor.

# homeWhatWeSpecializeInButton
source: Contact Us
pt: Entre em Contato

# homeOurPortfolioTitle
source: OUR PORTFOLIO
pt: NOSSO PORTFÓLIO

# homeOurPortfolioSubtitle
source: Discover Our Curated Selection
pt: Descubra Nossa Seleção Curada

# homeOurPortfolioDescription
source: Explore our handpicked collection of exceptional properties
pt: Explore nossa coleção selecionada de propriedades excepcionais

# homeOurPortfolioButton
source: Request a Private Consultation
pt: Solicitar Consultoria Privada

# propertiesTitle
source: Properties
pt: Propriedades

# propertiesSubtitle
source: Property Listings for Sale
pt: Listagens de Propriedades à Venda

# propertiesDescription
source: Browse our curated selection of premium properties available for purchase.
pt: Navegue pela nossa seleção curada de propriedades premium disponíveis para compra.

# offMarketTitle
source: Off Market
pt: Fora do Mercado

# offMarketSubtitle
source: Exclusive Off Market Opportunities
pt: Oportunidades Exclusivas Fora do Mercado

# offMarketDescription
source: Inquire only. Our curated selection of exclusive off-market opportunities — details shared upon inquiry through private consultation.
pt: Descubra nossa seleção curada de propriedades exclusivas fora do mercado disponíveis através de consultoria privada.

# offMarketViewProperties
source: Inquire About Off Market Opportunities
pt: Ver Propriedades Fora do Mercado

# clientOffMarketErrorLoading
source: Failed to load off-market properties
pt: Falha ao carregar propriedades fora do mercado

# clientOffMarketRetry
source: Retry
pt: Tentar Novamente

# clientOffMarketNoPropertiesFound
source: No off-market properties found
pt: Nenhuma propriedade fora do mercado encontrada

# clientOffMarketNoPropertiesMessage
source: We couldn't find any off-market properties matching your criteria. Try adjusting your filters.
pt: Não conseguimos encontrar propriedades fora do mercado que correspondam aos seus critérios. Tente ajustar seus filtros.

# clientOffMarketClearFilters
source: Clear Filters
pt: Limpar Filtros

# clientPropertiesShowMore
source: Show More
pt: Mostrar Mais

# clientPropertiesShowLess
source: Show Less
pt: Mostrar Menos

# clientPropertiesPriceOnRequest
source: Price on Request
pt: Preço Sob Consulta

# clientPropertiesViewDetails
source: View Details
pt: Ver Detalhes

# clientPropertiesNoPropertiesFound
source: No properties found
pt: Nenhuma propriedade encontrada

# clientPropertiesNoPropertiesMessage
source: We couldn't find any properties matching your criteria. Try adjusting your filters.
pt: Não conseguimos encontrar propriedades que correspondam aos seus critérios. Tente ajustar seus filtros.

# clientPropertiesClearFilters
source: Clear Filters
pt: Limpar Filtros

# clientPropertiesErrorLoading
source: Failed to load properties
pt: Falha ao carregar propriedades

# clientPropertiesRetry
source: Retry
pt: Tentar Novamente

# clientPropertiesFilters
source: Filters
pt: Filtros

# clientPropertiesSortBy
source: Sort By
pt: Ordenar Por

# clientPropertiesSortPriceLowHigh
source: Price: Low to High
pt: Preço: Menor para Maior

# clientPropertiesSortPriceHighLow
source: Price: High to Low
pt: Preço: Maior para Menor

# clientPropertiesSortNewest
source: Newest First
pt: Mais Recentes Primeiro

# clientPropertiesSortFeatured
source: Featured First
pt: Destaques Primeiro

# clientPropertiesSortAlphabetical
source: Alphabetical
pt: Alfabético

# clientPropertiesFilterPropertyType
source: Property Type
pt: Tipo de Propriedade

# clientPropertiesFilterLocation
source: Location
pt: Localização

# clientPropertiesFilterCountry
source: Country
pt: País

# clientPropertiesFilterCity
source: City
pt: Cidade

# clientPropertiesFilterPriceRange
source: Price Range
pt: Faixa de Preço

# clientPropertiesFilterBedrooms
source: Bedrooms
pt: Quartos

# clientPropertiesFilterBathrooms
source: Bathrooms
pt: Banheiros

# clientPropertiesFilterFeatured
source: Featured Only
pt: Apenas Destaques

# clientPropertiesFilterAll
source: All
pt: Todos

# clientPropertiesPaginationShowing
source: Showing
pt: Mostrando

# clientPropertiesPaginationOf
source: of
pt: de

# clientPropertiesPaginationResults
source: results
pt: resultados

# clientPropertyDetailInquire
source: Inquire About This Property
pt: Consultar Sobre Esta Propriedade

# clientPropertyDetailSpecifications
source: Specifications
pt: Especificações

# clientPropertyDetailFeatures
source: Features
pt: Características

# clientPropertyDetailLocation
source: Location
pt: Localização

# clientPropertyDetailDescription
source: Description
pt: Descrição

# clientPropertyDetailRelatedProperties
source: Related Properties
pt: Propriedades Relacionadas

# clientPropertyDetailNotFound
source: Property not found
pt: Propriedade não encontrada

# clientPropertyDetailBreadcrumbHome
source: Home
pt: Início

# clientPropertyDetailBreadcrumbProperties
source: Properties
pt: Propriedades

# clientPropertyDetailNotFoundMessage
source: The property you are looking for could not be found.
pt: A propriedade que você está procurando não pôde ser encontrada.

# contactTitle
source: Contact Us
pt: Entre em Contato

# contactFormTitle
source: Send Us a Message
pt: Envie-nos uma Mensagem

# contactFormName
source: Name
pt: Nome

# contactFormPhone
source: Phone
pt: Telefone

# contactFormMessage
source: Message
pt: Mensagem

# contactFormButton
source: Send Message
pt: Enviar Mensagem

# contactOfficeTitle
source: Elegant Office
pt: Escritório Elegant Advisors

# contactOfficeAddress
source: Address
pt: Endereço

# contactOfficePhone
source: Phone
pt: Telefone

# contactOfficeHours
source: Working Hours
pt: Horário de Funcionamento

# footerTagline
source: Elegant — Real Estate Advisory & Investment Brokerage
pt: Elegant Advisors - Seu Parceiro de Confiança em Consultoria de Propriedades e Ativos

# footerCopyright
source: © {year} Elegant. All rights reserved.
pt: © {year} Elegant Advisors. Todos os direitos reservados.

# contactSuccessMessage
source: Your message has been sent successfully!
pt: Sua mensagem foi enviada com sucesso!

# contactSuccessTitle
source: Success
pt: Sucesso

# myContactsTitle
source: My Contacts
pt: Meus Contatos

# myContactsSubtitle
source: View Your Contact Submissions
pt: Ver Seus Envios de Contato

# myContactsDescription
source: Track the status of your contact submissions and inquiries.
pt: Acompanhe o status de seus envios de contato e consultas.

# myContactsEnterEmail
source: Enter Your Email
pt: Digite Seu E-mail

# myContactsEnterEmailHint
source: Enter email address
pt: Digite o endereço de e-mail

# myContactsViewContacts
source: View My Contacts
pt: Ver Meus Contatos

# myContactsNoContactsFound
source: No contacts found
pt: Nenhum contato encontrado

# myContactsNoContactsMessage
source: You haven't submitted any contact forms yet, or no contacts match your email address.
pt: Você ainda não enviou nenhum formulário de contato, ou nenhum contato corresponde ao seu endereço de e-mail.

# myContactsFilterAll
source: All
pt: Todos

# myContactsFilterNew
source: New
pt: Novo

# myContactsFilterInProgress
source: In Progress
pt: Em Andamento

# myContactsFilterClosed
source: Closed
pt: Fechado

# myContactsStatusNew
source: New
pt: Novo

# myContactsStatusInProgress
source: In Progress
pt: Em Andamento

# myContactsStatusClosed
source: Closed
pt: Fechado

# myContactsDate
source: Date
pt: Data

# myContactsSubject
source: Subject
pt: Assunto

# myContactsMessage
source: Message
pt: Mensagem

# myContactsProperty
source: Property
pt: Propriedade

# myContactsNoProperty
source: General Inquiry
pt: Consulta Geral

# myContactsErrorLoading
source: Failed to load contacts
pt: Falha ao carregar contatos

# myContactsRetry
source: Retry
pt: Tentar Novamente

# myContactsClearFilters
source: Clear Filters
pt: Limpar Filtros

# myContactsFilters
source: Filters
pt: Filtros

# commonGoBack
source: Go Back
pt: Voltar

# commonGoHome
source: Go Home
pt: Ir para Início

# commonClose
source: Close
pt: Fechar

# commonRetry
source: Retry
pt: Tentar Novamente

# commonCancel
source: Cancel
pt: Cancelar

# commonPageNotFound
source: Page Not Found
pt: Página Não Encontrada

# commonSuccess
source: Success
pt: Sucesso

# commonError
source: Error
pt: Erro

# commonInfo
source: Info
pt: Informação

# commonWarning
source: Warning
pt: Aviso

# appTitleClient
source: Elegant — Real Estate Advisory & Investment Brokerage
pt: Elegant Advisors

# appTitleAdmin
source: Elegant — Admin
pt: Elegant Advisors - Admin

# locationGoogleMapsError
source: Could not open Google Maps
pt: Não foi possível abrir o Google Maps

# footerQuickLinksTitle
source: Quick Links
pt: Links Rápidos

# footerLinkMyContacts
source: View My Contacts
pt: Ver Meus Contatos

# footerLinkPrivacyPolicy
source: Privacy Policy
pt: Política de Privacidade

# footerLinkTermsOfService
source: Terms of Service
pt: Termos de Serviço

# footerCompanyDescription
source: Elegance, discretion, and integrity define how we operate. We take a considered, investment-led approach to real estate advisory, focusing on quality, alignment, and long-term value creation in every engagement.
pt: A Elegant é uma consultoria imobiliária definida por uma filosofia singular: o imobiliário, no seu melhor, é uma arte de elegância. Cuidamos de oportunidades excepcionais de propriedade em Portugal, guiados por discrição, conhecimento de mercado e padrões intransigentes.

# footerSocialTitle
source: Follow Us
pt: Siga-nos

# clientPropertiesViewProperties
source: View Properties
pt: Ver Propriedades

# clientPropertyDetailErrorLoading
source: Failed to load property
pt: Falha ao carregar propriedade

# contactFormEmailInvalid
source: Please provide a valid email address.
pt: Por favor, forneça um endereço de e-mail válido.

# contactFormSpamDetected
source: Your message contains inappropriate content.
pt: Sua mensagem contém conteúdo inadequado.

# contactFormSubjectInquiryAbout
source: Inquiry about {propertyTitle}
pt: Consulta sobre {propertyTitle}

# contactFormSubjectGeneralInquiry
source: General Inquiry
pt: Consulta Geral

# myContactsEmailInvalid
source: Please enter a valid email address
pt: Por favor, digite um endereço de e-mail válido

# myContactsErrorIndex
source: Failed to load contacts. Please ensure Firestore indexes are created. Check the Firebase console for index creation links.
pt: Falha ao carregar contatos. Por favor, certifique-se de que os índices do Firestore foram criados. Verifique o console do Firebase para links de criação de índice.

# myContactsErrorLoadingGeneric
source: Failed to load contacts. Please try again.
pt: Falha ao carregar contatos. Por favor, tente novamente.

# contactFormErrorSubmit
source: Failed to submit. Please try again.
pt: Falha ao enviar. Por favor, tente novamente.

# clientPropertiesFilterPriceMin
source: Min
pt: Mín

# clientPropertiesFilterPriceMax
source: Max
pt: Máx

# headerLanguageEnglish
source: English
pt: Inglês

# headerLanguagePortuguese
source: Portuguese
pt: Português

# clientPropertiesStatusAvailable
source: Available
pt: Disponível

# clientPropertiesStatusSold
source: Sold
pt: Vendido

# clientPropertiesStatusComingSoon
source: Coming Soon
pt: Em Breve

# clientPropertiesStatusOffMarket
source: Off Market
pt: Fora do Mercado

# contactOfficeAddressValue
source: 123 Main Street, Lisbon, Portugal
pt: 123 Main Street, Lisboa, Portugal

# contactOfficeHoursValue
source: Monday - Friday: 9:00 AM - 6:00 PM
pt: Segunda - Sexta: 9:00 - 18:00

# clientPropertyCardBed
source: bed
pt: quarto

# clientPropertyCardBath
source: bath
pt: banheiro

# clientPropertyDetailSpecType
source: Type:
pt: Tipo:

# clientPropertyDetailSpecBedrooms
source: Bedrooms:
pt: Quartos:

# clientPropertyDetailSpecBathrooms
source: Bathrooms:
pt: Banheiros:

# clientPropertyDetailSpecArea
source: Area:
pt: Área:

# privacyPolicyTitle
source: Privacy Policy
pt: Política de Privacidade

# privacyPolicyLastUpdated
source: Last Updated: {date}
pt: Última Atualização: {date}

# privacyPolicyIntroduction
source: At Elegant, we are committed to protecting your privacy. This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you visit our website and use our services.
pt: Na Elegant Advisors, estamos comprometidos em proteger sua privacidade. Esta Política de Privacidade explica como coletamos, usamos, divulgamos e protegemos suas informações quando você visita nosso site e usa nossos serviços.

# privacyPolicySection1Title
source: 1. Information We Collect
pt: 1. Informações que Coletamos

# privacyPolicySection1Content
source: We collect information that you provide directly to us, including: • Contact Information: When you submit a contact form, we collect your name, email address, phone number, subject, and message. • Property Inquiries: If you inquire about a specific property, we may associate your inquiry with that property. • IP Address: We may collect your IP address for security and analytics purposes. • Usage Data: We automatically collect information about how you interact with our website, including pages visited, time spent on pages, and property views. • Analytics Data: We use Firebase Analytics to track website usage, screen views, and user interactions.
pt: Coletamos informações que você nos fornece diretamente, incluindo: • Informações de Contato: Quando você envia um formulário de contato, coletamos seu nome, endereço de e-mail, número de telefone, assunto e mensagem. • Consultas sobre Propriedades: Se você consultar sobre uma propriedade específica, podemos associar sua consulta a essa propriedade. • Endereço IP: Podemos coletar seu endereço IP para fins de segurança e análise. • Dados de Uso: Coletamos automaticamente informações sobre como você interage com nosso site, incluindo páginas visitadas, tempo gasto nas páginas e visualizações de propriedades. • Dados de Análise: Usamos Firebase Analytics para rastrear o uso do site, visualizações de tela e interações do usuário.

# privacyPolicySection2Title
source: 2. How We Use Your Information
pt: 2. Como Usamos Suas Informações

# privacyPolicySection2Content
source: We use the information we collect to: • Respond to your inquiries and provide customer support • Process and manage your contact submissions • Improve our website and services • Analyze website usage and user behavior • Track property views and user engagement • Send you updates about properties or services (if you have opted in) • Comply with legal obligations
pt: Usamos as informações que coletamos para: • Responder às suas consultas e fornecer suporte ao cliente • Processar e gerenciar seus envios de contato • Melhorar nosso site e serviços • Analisar o uso do site e o comportamento do usuário • Rastrear visualizações de propriedades e engajamento do usuário • Enviar atualizações sobre propriedades ou serviços (se você optou por receber) • Cumprir obrigações legais

# privacyPolicySection3Title
source: 3. Data Storage and Security
pt: 3. Armazenamento e Segurança de Dados
