Repository: WMSols/elegant_advisors
Catalog: lib/core/l10n/app_*.arb
Languages: pt

# privacyPolicySection3Content
source: Your information is stored securely using: • Firebase Firestore: Contact submissions and related data are stored in Google Cloud Firestore • Firebase Storage: Property images and related files are stored securely • Local Storage: We use browser local storage (SharedPreferences) to remember your language preferences and improve your experience We implement appropriate technical and organizational measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction.
pt: Suas informações são armazenadas com segurança usando: • Firebase Firestore: Envios de contato e dados relacionados são armazenados no Google Cloud Firestore • Firebase Storage: Imagens de propriedades e arquivos relacionados são armazenados com segurança • Armazenamento Local: Usamos armazenamento local do navegador (SharedPreferences) para lembrar suas preferências de idioma e melhorar sua experiência Implementamos medidas técnicas e organizacionais apropriadas para proteger suas informações pessoais contra acesso não autorizado, alteração, divulgação ou destruição.

# privacyPolicySection4Title
source: 4. Third-Party Services
pt: 4. Serviços de Terceiros

# privacyPolicySection4Content
source: We use the following third-party services that may collect information: • Google Firebase: For data storage, analytics, and authentication services • Firebase Analytics: For website usage analytics and tracking These services have their own privacy policies governing the collection and use of your information.
pt: Usamos os seguintes serviços de terceiros que podem coletar informações: • Google Firebase: Para armazenamento de dados, análises e serviços de autenticação • Firebase Analytics: Para análises e rastreamento de uso do site Esses serviços têm suas próprias políticas de privacidade que regem a coleta e o uso de suas informações.

# privacyPolicySection5Title
source: 5. Data Retention
pt: 5. Retenção de Dados

# privacyPolicySection5Content
source: We retain your personal information for as long as necessary to fulfill the purposes outlined in this Privacy Policy, unless a longer retention period is required or permitted by law. Contact submissions are retained to provide customer support and track inquiry history.
pt: Retemos suas informações pessoais pelo tempo necessário para cumprir os propósitos descritos nesta Política de Privacidade, a menos que um período de retenção mais longo seja exigido ou permitido por lei. Os envios de contato são retidos para fornecer suporte ao cliente e rastrear o histórico de consultas.

# privacyPolicySection6Title
source: 6. Your Rights
pt: 6. Seus Direitos

# privacyPolicySection6Content
source: Depending on your location, you may have the following rights regarding your personal information: • Access: Request access to your personal information • Correction: Request correction of inaccurate information • Deletion: Request deletion of your personal information • Objection: Object to processing of your personal information • Data Portability: Request transfer of your data To exercise these rights, please contact us using the information provided in the Contact section.
pt: Dependendo da sua localização, você pode ter os seguintes direitos em relação às suas informações pessoais: • Acesso: Solicitar acesso às suas informações pessoais • Correção: Solicitar correção de informações imprecisas • Exclusão: Solicitar exclusão de suas informações pessoais • Oposição: Opor-se ao processamento de suas informações pessoais • Portabilidade de Dados: Solicitar transferência de seus dados Para exercer esses direitos, entre em contato conosco usando as informações fornecidas na seção Contato.

# privacyPolicySection7Title
source: 7. Cookies and Local Storage
pt: 7. Cookies e Armazenamento Local

# privacyPolicySection7Content
source: We use browser local storage to remember your language preferences and improve your browsing experience. This information is stored locally on your device and is not transmitted to our servers except as part of normal website functionality.
pt: Usamos armazenamento local do navegador para lembrar suas preferências de idioma e melhorar sua experiência de navegação. Essas informações são armazenadas localmente no seu dispositivo e não são transmitidas para nossos servidores, exceto como parte da funcionalidade normal do site.

# privacyPolicySection8Title
source: 8. Children's Privacy
pt: 8. Privacidade de Menores

# privacyPolicySection8Content
source: Our services are not directed to individuals under the age of 18. We do not knowingly collect personal information from children. If you believe we have collected information from a child, please contact us immediately.
pt: Nossos serviços não são direcionados a menores de 18 anos. Não coletamos intencionalmente informações pessoais de crianças. Se você acredita que coletamos informações de uma criança, entre em contato conosco imediatamente.

# privacyPolicySection9Title
source: 9. Changes to This Privacy Policy
pt: 9. Alterações nesta Política de Privacidade

# privacyPolicySection9Content
source: We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page and updating the "Last Updated" date. You are advised to review this Privacy Policy periodically for any changes.
pt: Podemos atualizar esta Política de Privacidade periodicamente. Notificaremos você sobre quaisquer alterações publicando a nova Política de Privacidade nesta página e atualizando a data de "Última Atualização". Recomendamos que você revise esta Política de Privacidade periodicamente para verificar alterações.

# privacyPolicySection10Title
source: 10. Contact Us
pt: 10. Entre em Contato

# privacyPolicySection10Content
source: If you have any questions about this Privacy Policy or our data practices, please contact us: Elegant Email: info@elegantadvisors.com Phone: +351 123 456 789
pt: Se você tiver alguma dúvida sobre esta Política de Privacidade ou nossas práticas de dados, entre em contato conosco: Elegant Advisors E-mail: info@elegantadvisors.com Telefone: +351 123 456 789

# termsOfServiceTitle
source: Terms of Service
pt: Termos de Serviço

# termsOfServiceLastUpdated
source: Last Updated: {date}
pt: Última Atualização: {date}

# termsOfServiceIntroduction
source: Welcome to Elegant. These Terms of Service govern your access to and use of our website and services. By accessing or using our website, you agree to be bound by these Terms.
pt: Bem-vindo à Elegant Advisors. Estes Termos de Serviço regem seu acesso e uso de nosso site e serviços. Ao acessar ou usar nosso site, você concorda em estar vinculado a estes Termos.

# termsOfServiceSection1Title
source: 1. Acceptance of Terms
pt: 1. Aceitação dos Termos

# termsOfServiceSection1Content
source: By accessing and using the Elegant website, you accept and agree to be bound by the terms and provision of this agreement. If you do not agree to these Terms, please do not use our website.
pt: Ao acessar e usar o site da Elegant Advisors, você aceita e concorda em estar vinculado aos termos e disposições deste acordo. Se você não concordar com estes Termos, por favor, não use nosso site.

# termsOfServiceSection2Title
source: 2. Use of Website
pt: 2. Uso do Site

# termsOfServiceSection2Content
source: You agree to use our website only for lawful purposes and in a way that does not infringe the rights of, restrict, or inhibit anyone else's use and enjoyment of the website. Prohibited behavior includes harassing or causing distress or inconvenience to any person, transmitting obscene or offensive content, or disrupting the normal flow of dialogue within our website.
pt: Você concorda em usar nosso site apenas para fins legais e de uma forma que não infrinja os direitos de, restrinja ou iniba o uso e o prazer de qualquer outra pessoa no site. Comportamento proibido inclui assediar ou causar angústia ou inconveniência a qualquer pessoa, transmitir conteúdo obsceno ou ofensivo, ou interromper o fluxo normal de diálogo em nosso site.

# termsOfServiceSection3Title
source: 3. Property Information
pt: 3. Informações sobre Propriedades

# termsOfServiceSection3Content
source: All property information, descriptions, images, and specifications displayed on our website are provided for informational purposes only. While we strive to ensure accuracy, we do not guarantee the completeness, reliability, or accuracy of any property information. Property availability, prices, and specifications are subject to change without notice.
pt: Todas as informações, descrições, imagens e especificações de propriedades exibidas em nosso site são fornecidas apenas para fins informativos. Embora nos esforcemos para garantir a precisão, não garantimos a integridade, confiabilidade ou precisão de qualquer informação sobre propriedades. A disponibilidade, preços e especificações das propriedades estão sujeitos a alterações sem aviso prévio.

# termsOfServiceSection4Title
source: 4. Contact Form and Submissions
pt: 4. Formulário de Contato e Envios

# termsOfServiceSection4Content
source: When you submit a contact form or inquiry: • You agree to provide accurate and truthful information • You grant us permission to use your contact information to respond to your inquiry • You understand that we may store your submission for customer service and record-keeping purposes • You agree not to submit any unlawful, harmful, or inappropriate content
pt: Quando você envia um formulário de contato ou consulta: • Você concorda em fornecer informações precisas e verdadeiras • Você nos concede permissão para usar suas informações de contato para responder à sua consulta • Você entende que podemos armazenar seu envio para fins de atendimento ao cliente e manutenção de registros • Você concorda em não enviar qualquer conteúdo ilegal, prejudicial ou inadequado

# termsOfServiceSection5Title
source: 5. Intellectual Property
pt: 5. Propriedade Intelectual

# termsOfServiceSection5Content
source: All content on this website, including text, graphics, logos, images, and software, is the property of Elegant or its content suppliers and is protected by copyright and other intellectual property laws. You may not reproduce, distribute, modify, or create derivative works from any content without our express written permission.
pt: Todo o conteúdo neste site, incluindo texto, gráficos, logotipos, imagens e software, é propriedade da Elegant Advisors ou de seus fornecedores de conteúdo e é protegido por leis de direitos autorais e outras leis de propriedade intelectual. Você não pode reproduzir, distribuir, modificar ou criar obras derivadas de qualquer conteúdo sem nossa permissão expressa por escrito.

# termsOfServiceSection6Title
source: 6. Limitation of Liability
pt: 6. Limitação de Responsabilidade

# termsOfServiceSection6Content
source: Elegant shall not be liable for any indirect, incidental, special, consequential, or punitive damages resulting from your use of or inability to use the website or services. We do not guarantee that the website will be available at all times or free from errors or interruptions.
pt: A Elegant Advisors não será responsável por quaisquer danos indiretos, incidentais, especiais, consequenciais ou punitivos resultantes do seu uso ou incapacidade de usar o site ou serviços. Não garantimos que o site estará disponível o tempo todo ou livre de erros ou interrupções.

# termsOfServiceSection7Title
source: 7. Disclaimer of Warranties
pt: 7. Isenção de Garantias

# termsOfServiceSection7Content
source: The website and services are provided "as is" and "as available" without any warranties of any kind, either express or implied. We do not warrant that the website will be uninterrupted, secure, or error-free, or that defects will be corrected.
pt: O site e os serviços são fornecidos "como estão" e "conforme disponível" sem quaisquer garantias de qualquer tipo, expressas ou implícitas. Não garantimos que o site será ininterrupto, seguro ou livre de erros, ou que os defeitos serão corrigidos.

# termsOfServiceSection8Title
source: 8. Links to Third-Party Websites
pt: 8. Links para Sites de Terceiros

# termsOfServiceSection8Content
source: Our website may contain links to third-party websites, including social media platforms and mapping services. We are not responsible for the content, privacy policies, or practices of any third-party websites. Your use of third-party websites is at your own risk.
pt: Nosso site pode conter links para sites de terceiros, incluindo plataformas de mídia social e serviços de mapeamento. Não somos responsáveis pelo conteúdo, políticas de privacidade ou práticas de quaisquer sites de terceiros. Seu uso de sites de terceiros é por sua conta e risco.

# termsOfServiceSection9Title
source: 9. Modifications to Terms
pt: 9. Modificações dos Termos

# termsOfServiceSection9Content
source: We reserve the right to modify these Terms of Service at any time. We will notify users of any material changes by updating the "Last Updated" date on this page. Your continued use of the website after such modifications constitutes acceptance of the updated Terms.
pt: Reservamo-nos o direito de modificar estes Termos de Serviço a qualquer momento. Notificaremos os usuários sobre quaisquer alterações materiais atualizando a data de "Última Atualização" nesta página. Seu uso contínuo do site após tais modificações constitui aceitação dos Termos atualizados.

# termsOfServiceSection10Title
source: 10. Governing Law
pt: 10. Lei Aplicável

# termsOfServiceSection10Content
source: These Terms of Service shall be governed by and construed in accordance with the laws of Portugal, without regard to its conflict of law provisions.
pt: Estes Termos de Serviço serão regidos e interpretados de acordo com as leis de Portugal, sem levar em consideração suas disposições de conflito de leis.

# termsOfServiceSection11Title
source: 11. Contact Information
pt: 11. Informações de Contato

# termsOfServiceSection11Content
source: If you have any questions about these Terms of Service, please contact us: Elegant Email: info@elegantadvisors.com Phone: +351 123 456 789
pt: Se você tiver alguma dúvida sobre estes Termos de Serviço, entre em contato conosco: Elegant Advisors E-mail: info@elegantadvisors.com Telefone: +351 123 456 789
